Delans-TLE/src/Documents/ES_ПеремещениеЗаказов/ES_ПеремещениеЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ES_ПеремещениеЗаказов</name>
  <basedOn>Document.ES_Приемка</basedOn>
  <basedOn>Document.ES_ПланДоставки</basedOn>
  <registerRecords>InformationRegister.ES_СтатусыЗаказов</registerRecords>
  <registerRecords>InformationRegister.ES_ИзменяемыеРеквизитыЗаборов</registerRecords>
  <registerRecords>InformationRegister.ES_ИзменяемыеРеквизитыЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ES_ЗаказыВПути</registerRecords>
  <registerRecords>InformationRegister.ES_СведенияОЗаказах</registerRecords>
  <registerRecords>AccumulationRegister.ES_ЗаказыНаСкладе</registerRecords>
  <registerRecords>AccumulationRegister.ES_НаложенныеПлатежиПартнеров</registerRecords>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПодтверждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ES_ВидыОперацийПеремещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладКуреьра</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ES_Приемка</types>
      <types>DocumentRef.ES_ПланДоставки</types>
      <types>DocumentRef.ES_ОтчетОДоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ES_ЗаборГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>СвязанныйДокумент</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ES_ЗаборГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВхНакладная</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяДобавленияЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъемныйВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аббревиатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>EnumRef.ES_СтатусыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоставки</name>
      <type>
        <types>EnumRef.ES_ВидыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НППлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Мест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проверен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ES_Приемка</types>
        <types>DocumentRef.ES_ПланДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиВЗаказе</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатурыЗапас</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НППлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемныйВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбьявленнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Опасность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Платежи</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>EnumRef.ES_СтатусыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоставки</name>
      <type>
        <types>EnumRef.ES_ВидыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НПФактНал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НПФактБезнал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КОтправке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Delans-TLE/src/Enums/ES_ВидыОперацийПеремещение/ES_ВидыОперацийПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ES_ВидыОперацийПеремещение</name>
  <enumValues>
    <name>Заказы</name>
  </enumValues>
  <enumValues>
    <name>НаложенныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>Курьер</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/Documents/ES_ПеремещениеЗаказов/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Печать

#Область Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	//ЕФСОЛ Савченко К.Р. 16.09.2017 +
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ES_ПеремещениеНаложенныхПлатежей") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ES_ПеремещениеНаложенныхПлатежей", "ПеремещениеНаложенныхПлатежей", СформироватьПечатнуюФормуПеремещениеНаложенныхПлатежей(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ES_ПеремещениеЗаказов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ES_ПеремещениеЗаказов", "ПеремещениеЗаказов", СформироватьПечатнуюФормуПеремещениеЗаказов(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	//ЕФСОЛ Савченко К.Р. 16.09.2017 -
КонецПроцедуры

// Заполняет список команд печати Заказа покупателя
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//ЕФСОЛ Савченко К.Р. 16.09.2017 +
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_ES_ПеремещениеНаложенныхПлатежей";
	КомандаПечати.Представление = НСтр("ru = 'Перемещение наложенных платежей'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаВыбора";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ГруппаВажныеКоманды";
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_ES_ПеремещениеЗаказов";
	КомандаПечати.Представление = НСтр("ru = 'Перемещение заказов'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаВыбора";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ГруппаВажныеКоманды";
	КомандаПечати.Порядок = 5;
	//ЕФСОЛ Савченко К.Р. 16.09.2017 -
КонецПроцедуры

Функция СформироватьПечатнуюФормуПеремещениеНаложенныхПлатежей(МассивОбъектов, ОбъектыПечати) 
	//ЕФСОЛ Савченко К.Р. 16.09.2017 +
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПФ_MXL_ES_ПеремещениеНаложенныхПлатежей";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ES_ПеремещениеЗаказовПлатежи.НомерСтроки КАК НомерСтроки,
	|	ES_ПеремещениеЗаказовПлатежи.Заказ КАК Заказ,
	|	ES_ПеремещениеЗаказовПлатежи.НомерНакладной КАК НомерНакладной,
	|	ES_ПеремещениеЗаказовПлатежи.СтатусЗаказа КАК СтатусЗаказа,
	|	ES_ПеремещениеЗаказовПлатежи.НПФактНал КАК НПФактНал,
	|	ES_ПеремещениеЗаказовПлатежи.НПФактБезнал КАК НПФактБезнал,
	|	ES_ПеремещениеЗаказовПлатежи.КОтправке КАК КОтправке,
	|	ES_ДанныеПоЗаказам.НППлан КАК НППлан,
	|	ES_ПеремещениеЗаказовПлатежи.Ссылка КАК Ссылка,
	|	ES_ПеремещениеЗаказов.Партнер КАК Партнер,
	|	ES_ПеремещениеЗаказов.ВидОперации КАК ВидОперации,
	|	ES_ПеремещениеЗаказовПлатежи.Заказ.ES_АдресДоставки КАК ЗаказES_АдресДоставки,
	|	ES_ПеремещениеЗаказовПлатежи.Заказ.ES_НППлан КАК ЗаказES_НППлан,
	|	ES_ПеремещениеЗаказовПлатежи.Заказ.ВидОперации,
	|	ES_ПеремещениеЗаказов.Ответственный КАК Ответственный,
	|	ES_ПеремещениеЗаказов.Номер КАК Номер
	|ИЗ
	|	Документ.ES_ПеремещениеЗаказов.Платежи КАК ES_ПеремещениеЗаказовПлатежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ES_ДанныеПоЗаказам КАК ES_ДанныеПоЗаказам
	|		ПО ES_ПеремещениеЗаказовПлатежи.Ссылка = ES_ДанныеПоЗаказам.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ES_ПеремещениеЗаказов КАК ES_ПеремещениеЗаказов
	|		ПО ES_ПеремещениеЗаказовПлатежи.Ссылка = ES_ПеремещениеЗаказов.Ссылка
	|ГДЕ
	|	ES_ПеремещениеЗаказовПлатежи.Ссылка В(&МассивОбъектов)
	|	И ES_ПеремещениеЗаказов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ES_ВидыОперацийПеремещение.НаложенныеПлатежи)
	|ИТОГИ
	|	МАКСИМУМ(НомерСтроки),
	|	МАКСИМУМ(Заказ),
	|	МАКСИМУМ(НомерНакладной),
	|	МАКСИМУМ(СтатусЗаказа),
	|	СУММА(НПФактНал),
	|	СУММА(НПФактБезнал),
	|	МАКСИМУМ(КОтправке),
	|	СУММА(НППлан),
	|	МАКСИМУМ(Партнер),
	|	МАКСИМУМ(ВидОперации),
	|	МАКСИМУМ(ЗаказES_АдресДоставки),
	|	СУММА(ЗаказES_НППлан),
	|	МАКСИМУМ(Ответственный),
	|	МАКСИМУМ(Номер)
	|ПО
	|	Ссылка";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	//ВидОперации = Перечисления.ES_ВидыОперацийПеремещение.НаложенныеПлатежи;
	//Запрос.УстановитьПараметр("ВидОперации",ВидОперации);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если  РезультатЗапроса.Пустой() Тогда
		Сообщить("Вид операции не соответствует выбору печатной формы."); 
		Возврат ТабДок;
	КонецЕсли;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ES_ПеремещениеЗаказов.ПФ_MXL_ES_ПеремещениеНаложенныхПлатежей");
		Если ТипЗнч(Макет)<> Тип("ТабличныйДокумент") Тогда
			Макет = ПолучитьМакет("ПФ_MXL_ES_ПеремещениеНаложенныхПлатежей");
		КонецЕсли;
		
		ПервыйДокумент = Истина;
		
		ВыборкаИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
		Пока ВыборкаИтог.Следующий() Цикл
			
			Если ПервыйДокумент Тогда
				ПервыйДокумент = Ложь;
			Иначе	
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбластьШапка = Макет.ПолучитьОбласть("Заголовок");
			ОбластьШапка.Параметры.Номер = ВыборкаИтог.НомерНакладной;
			ОбластьШапка.Параметры.Партнер = ВыборкаИтог.Партнер;
			ТабДок.Вывести(ОбластьШапка);
			
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабДок.Вывести(ОбластьШапка);
			
			// Строки таблицы
			Выборка = ВыборкаИтог.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
				
				ОбластьСтрока.Параметры.Номер 			= Выборка.НомерСтроки;
				ОбластьСтрока.Параметры.Заказ 			=  "Заказ на доставку " + "
			 |" + Выборка.Номер;				
				ОбластьСтрока.Параметры.Накладная       = Выборка.НомерНакладной;
				ОбластьСтрока.Параметры.АдресДоставки 	= Выборка.ЗаказES_АдресДоставки;
				ОбластьСтрока.Параметры.Статус          = Выборка.СтатусЗаказа;
				ОбластьСтрока.Параметры.НППлан 			= Формат(Выборка.ЗаказES_НППлан,"ЧДЦ=2");
								
				ОбластьСтрока.Параметры.НПФактНал 		= Формат(Выборка.НПФактНал,"ЧДЦ=2");
				ОбластьСтрока.Параметры.НПФактБН		= Формат(Выборка.НПФактБезнал,"ЧДЦ=2");
				ОбластьСтрока.Параметры.Сумма           = Формат(Выборка.КОтправке,"ЧДЦ=2");
				
				ТабДок.Вывести(ОбластьСтрока);
				
			КонецЦикла;
			
			ОбластьИтого = Макет.ПолучитьОбласть("Подвал");
			ОбластьИтого.Параметры.Ответственный = ВыборкаИтог.Ответственный;
			ТабДок.Вывести(ОбластьИтого);
			
		КонецЦикла;
					
		Возврат ТабДок;
		
	КонецЕсли;
	//ЕФСОЛ Савченко К.Р. 16.09.2017 -	
КонецФункции

Функция СформироватьПечатнуюФормуПеремещениеЗаказов (МассивОбъектов, ОбъектыПечати)
	//ЕФСОЛ Савченко К.Р. 16.09.2017 +
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПФ_MXL_ES_ПеремещениеЗаказов";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ES_ПеремещениеЗаказов.Партнер КАК Партнер,
	|	ES_ПеремещениеЗаказов.Ссылка КАК Ссылка,
	|	ES_ПеремещениеЗаказовЗаказы.НомерСтроки КАК НомерСтроки,
	|	ES_ПеремещениеЗаказовЗаказы.Заказ КАК Заказ,
	|	ES_ПеремещениеЗаказовЗаказы.НомерНакладной КАК НомерНакладной,
	|	ES_ПеремещениеЗаказовЗаказы.СтатусЗаказа КАК СтатусЗаказа,
	|	ES_ПеремещениеЗаказовЗаказы.АдресДоставки КАК АдресДоставки,
	|	ES_ПеремещениеЗаказовЗаказы.ДатаВремяДобавленияЗаказа КАК ДатаВремяДобавленияЗаказа,
	|	ES_ПеремещениеЗаказовЗаказы.ОбщийВес КАК ОбщийВес,
	|	ES_ПеремещениеЗаказов.ВидОперации КАК ВидОперации,
	|	ES_ПеремещениеЗаказовЗаказы.Заказ.Комментарий,
	|	ES_ПеремещениеЗаказовЗаказы.Заказ.ES_ВхНакладная КАК ЗаказES_ВхНакладная,
	|	ES_ПеремещениеЗаказов.Ответственный КАК Ответственный,
	|	ES_ПеремещениеЗаказов.Номер КАК Номер
	|ИЗ
	|	Документ.ES_ПеремещениеЗаказов.Заказы КАК ES_ПеремещениеЗаказовЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ES_ПеремещениеЗаказов КАК ES_ПеремещениеЗаказов
	|		ПО ES_ПеремещениеЗаказовЗаказы.Ссылка = ES_ПеремещениеЗаказов.Ссылка
	|ГДЕ
	|	ES_ПеремещениеЗаказовЗаказы.Ссылка В(&МассивОбъектов)
	|	И ES_ПеремещениеЗаказов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ES_ВидыОперацийПеремещение.Заказы)
	|ИТОГИ
	|	МАКСИМУМ(Партнер),
	|	МАКСИМУМ(НомерСтроки),
	|	МАКСИМУМ(Заказ),
	|	МАКСИМУМ(НомерНакладной),
	|	МАКСИМУМ(СтатусЗаказа),
	|	МАКСИМУМ(АдресДоставки),
	|	МАКСИМУМ(ДатаВремяДобавленияЗаказа),
	|	МАКСИМУМ(ОбщийВес),
	|	МАКСИМУМ(ВидОперации),
	|	МАКСИМУМ(ЗаказES_ВхНакладная),
	|	МАКСИМУМ(Ответственный),
	|	МАКСИМУМ(Номер)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если  РезультатЗапроса.Пустой() Тогда
		Сообщить("Вид операции не соответствует выбору печатной формы."); 
		Возврат ТабДок;
	КонецЕсли;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		     
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ES_ПеремещениеЗаказов.ПФ_MXL_ES_ПеремещениеЗаказов");
		Если ТипЗнч(Макет)<> Тип("ТабличныйДокумент") Тогда
			Макет = ПолучитьМакет("ПФ_MXL_ES_ПеремещениеЗаказов");	
		КонецЕсли;
		
		ПервыйДокумент = Истина;
		
		ВыборкаИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	
		
		Пока ВыборкаИтог.Следующий() Цикл
			
			Если ПервыйДокумент Тогда
				ПервыйДокумент = Ложь;
			Иначе	
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;                                                       
						
			ОбластьШапка = Макет.ПолучитьОбласть("Заголовок");
			ОбластьШапка.Параметры.Номер = ВыборкаИтог.НомерНакладной;
			ОбластьШапка.Параметры.Партнер = ВыборкаИтог.Партнер;
			ТабДок.Вывести(ОбластьШапка);
			
			ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабДок.Вывести(ОбластьШапка);
						
			// Строки таблицы
			Выборка = ВыборкаИтог.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
				
				ОбластьСтрока.Параметры.Номер 			= Выборка.НомерСтроки;
				ОбластьСтрока.Параметры.Заказ 			=  "Заказ на доставку " + "
			 |" + Выборка.НомерНакладной;
				//ОбластьСтрока.Параметры.Накладная       = Выборка.НомерНакладной;
				ОбластьСтрока.Параметры.АдресДоставки 	= Выборка.АдресДоставки;
				ОбластьСтрока.Параметры.ВхНакладная     = Выборка.ЗаказES_ВхНакладная;
				ОбластьСтрока.Параметры.Статус 			= Выборка.СтатусЗаказа;
				
				ОбластьСтрока.Параметры.Примечание 		= Выборка.Заказ.Комментарий;
				ОбластьСтрока.Параметры.Вес		        = Формат(Выборка.ОбщийВес, "ЧДЦ=3");
				ОбластьСтрока.Параметры.Дата            = Формат(Выборка.ДатаВремяДобавленияЗаказа, "ДФ=dd.MM.yyyy");
				
				ТабДок.Вывести(ОбластьСтрока);
				
			КонецЦикла;
			
			ОбластьИтого = Макет.ПолучитьОбласть("Подвал");
			ОбластьИтого.Параметры.Ответственный = ВыборкаИтог.Ответственный;
            ТабДок.Вывести(ОбластьИтого);
			
		КонецЦикла;
		Возврат ТабДок;
		
	КонецЕсли;
	//ЕФСОЛ Савченко К.Р. 16.09.2017 -	
КонецФункции
#КонецОбласти
